---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.ScaledInnerPerimeter
source: html/81db0c0e-c1df-7b1c-736e-04ccb1a4f134.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.ScaledInnerPerimeter Property

The inner perimeter of the extrusion, scaled to the units of export.

## Syntax (C#)
```csharp
public double ScaledInnerPerimeter { get; set; }
```